from analyzer import *

print('''
                          _
                         | \\
                         | |
   |\                    | |
  /, ~\                 / /
X     `-.....--------./ /
 '~-. ~  ~               |
     \              /    |
      \  /_      ___\   /
      | /\ ~~~~~~~   \ |
      | | \          || |
      | |\ \         || )
     (_/ (_/        ((_/
''')

print("__________________________________\nВы попали в программу 'Aвтоответчик.'")

analyzer()






































